var base = ( function(){
	var GroupA = [
		{
			name: "Andrey",
			predmet: [
			{ name : "Фізика", digit : [4,'н','н',5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,7,4,5,6,1,8,9,5,6] },			
			{ name : "Біологія", digit : [9,9,4,5,8,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,3,6,6,8,9,'н',6] },			
			{ name : "Малювання", digit : [4,3,5,5,6,'н','н','н',5,6] }
			]
		},
		{
			name: "Petro",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,'н',4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,'н',5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,'н',5,6,5,8,9,5,6] }			
			]
		},
		{
			name: "Jora",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,'н','н','н','н',5,6] },	
			{ name : "Математика", digit : [4,8,4,9,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,'н',5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "John",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,'н','н',8,9,5,6] },	
			{ name : "Математика", digit : [4,3,'н',5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "Olga",
			predmet: [
			{ name : "Фізика", digit : ['н',3,4,5,1,5,8,1,5,6] },	
			{ name : "Математика", digit : ['н',3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,'н',4,5,6,5,8,9,'н',6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,'н',6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "Kate",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,1,'н','н','н','н','н','н'] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [8,9,9,9,7,8,8,9,9,10] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "Ivanka",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,1,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,'н',5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,'н',6,5,'н',9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,5,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "Yura",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,'н','н','н',5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,'н',5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "Vlad",
			predmet: [
			{ name : "Фізика", digit : [4,3,10,10,6,5,8,10,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,'н',1,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "Timon",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,'н',9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,'н','н',6,5,8,'н',5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,'н',9,5,6] },			
			{ name : "Малювання", digit : [4,3,'н',5,6,5,8,9,5,6] }		
			]
		}
	];
	var GroupB = [
		{
			name: "AndreyA",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,10,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,'н',5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,10,4,5,6,'н',8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,'н',5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }
			]
		},
		{
			name: "PetroP",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [1,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,1,4,5,10,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }			
			]
		},
		{
			name: "JoraJ",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,9,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,9,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,'н',5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "JohnJ",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,'н',8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "OlgaO",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,'н',5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,1,1,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "KateK",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,1,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "IvankaI",
			predmet: [
			{ name : "Фізика", digit : [4,10,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,'н','н','н',6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "YuraY",
			predmet: [
			{ name : "Фізика", digit : [4,10,4,7,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,'н','н',8,9,5,6] },			
			{ name : "Хімія", digit : [4,10,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "VladV",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,'н',8,'н',5,6] },	
			{ name : "Математика", digit : [4,'н',4,5,6,5,8,'н',5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,'н',5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,9,8,10,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "TimonT",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,10,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,10,4,5,6,10,8,9,5,6] }		
			]
		}
	];
	var GroupC = [
		{
			name: "AndreyAA",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,1,1,5,6] },	
			{ name : "Математика", digit : [4,3,'н','н',6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,'н',9,5,6] },			
			{ name : "Хімія", digit : [4,1,4,5,6,5,'н',9,5,6] },			
			{ name : "Малювання", digit : [4,5,4,10,6,5,8,9,5,6] }
			]
		},
		{
			name: "PetroPP",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,'н',6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,'н','н',5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,'н','н','н','н'] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,10,10,9,6,5,8,9,5,6] }			
			]
		},
		{
			name: "JoraJJ",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,'н',6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "JohnJJ",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,9,9,5,9,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,'н',5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : ['н','н',4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "OlgaOO",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,'н'] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,'н',5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,'н'] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "KateKK",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,'н',5,'н',5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "IvankaII",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,'н',6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,'н',5,6] },			
			{ name : "Біологія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Малювання", digit : ['н','н',4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "YuraYY",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,'н',6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,5,8,'н',5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,'н',5,6] }		
			]
		},
		{
			name: "VladVV",
			predmet: [
			{ name : "Фізика", digit : [4,3,4,5,6,5,8,'н',5,6] },	
			{ name : "Математика", digit : [4,3,4,5,6,5,'н',9,5,6] },			
			{ name : "Біологія", digit : [4,3,'н',5,6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,6,'н',8,9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		},
		{
			name: "TimonTT",
			predmet: [
			{ name : "Фізика", digit : [4,3,'н',5,6,5,8,9,5,6] },	
			{ name : "Математика", digit : ['н',3,4,5,'н',5,8,9,5,6] },			
			{ name : "Біологія", digit : [4,3,4,'н',6,5,8,9,5,6] },			
			{ name : "Хімія", digit : [4,3,4,5,'н','н','н',9,5,6] },			
			{ name : "Малювання", digit : [4,3,4,5,6,5,8,9,5,6] }		
			]
		}
	];
	var MegaArray = GroupA.concat(GroupB,GroupC);
	var searchByName = function(Name){		
		var result = [];
		for(var i = 0; i < MegaArray.length; i++){
			if(MegaArray[i].name == Name){				
				result.push(MegaArray[i]);
			}
		}
		return result;
	};	
	var PrintMegaArray = function(){		
		var result = [];
		for(var i = 0; i < MegaArray.length; i++){							
			result.push(MegaArray[i]);			
		}
		return result;
	};	
	var GroupArrayA = function(){		
		var result = [];
		for(var i = 0; i < GroupA.length; i++){							
			result.push(GroupA[i]);		
		}
		return result;
	};
	var GroupArrayB = function(){		
		var result = [];
		for(var i = 0; i < GroupB.length; i++){							
			result.push(GroupB[i]);		
		}
		return result;
	};
	var GroupArrayC = function(){		
		var result = [];
		for(var i = 0; i < GroupC.length; i++){							
			result.push(GroupC[i]);		
		}
		return result;
	};	
	return{		
		PrintMegaArray : PrintMegaArray,
		searchByName : searchByName,
		GroupArrayA : GroupArrayA,
		GroupArrayB : GroupArrayB,
		GroupArrayC : GroupArrayC						
	};
})();